[
  {
    "id": "1",
    "title": "Keistimewaan Puasa Arafah",
    "content": "Puasa Arafah memiliki banyak keutamaan, salah satunya adalah pengampunan dosa tahun lalu dan tahun yang akan datang...",
    "date": "2026-02-22"
  },
  {
    "id": "101",
    "title": "Adab Sebelum Tidur Sesuai Sunnah",
    "content": "Tidur bukan sekadar istirahat, namun bernilai ibadah jika dilakukan sesuai sunnah. Pertama, berwudhu seperti hendak sholat. Kedua, mengibaskan tempat tidur dengan ujung kain. Ketiga, membaca Ayatul Kursi dan 3 Qul (Al-Ikhlas, Al-Falaq, An-Nas) lalu ditiupkan ke telapak tangan dan diusapkan ke seluruh tubuh. Keempat, membaca doa sebelum tidur. Terakhir, berbaring menghadap kanan.",
    "date": "2026-02-21"
  },
  {
    "id": "102",
    "title": "Mengapa Sholat Subuh Terasa Berat?",
    "content": "Sholat Subuh seringkali menjadi tantangan terbesar karena godaan setan yang mengikat tiga ikatan di tengkuk manusia saat tidur. Ikatan ini hanya lepas dengan: 1. Bangun dan mengingat Allah, 2. Berwudhu, 3. Mendirikan sholat. Barangsiapa sholat Subuh berjamaah, ia berada dalam jaminan perlindungan Allah hingga petang.",
    "date": "2026-02-20"
  },
  {
    "id": "103",
    "title": "Rahasia Sehat Puasa Sunnah Senin Kamis",
    "content": "Secara medis, puasa intermiten (dua kali seminggu) terbukti meningkatkan sensitivitas insulin, regenerasi sel (autophagy), dan menurunkan risiko penyakit mematikan. Nabi Muhammad SAW berpuasa pada hari Senin dan Kamis karena pada hari itulah amal manusia diangkat ke langit, dan beliau senang amalnya diangkat dalam keadaan berpuasa.",
    "date": "2026-02-19"
  },
  {
    "id": "104",
    "title": "Keutamaan Menyambung Tali Silaturahmi",
    "content": "Dalam era digital, silaturahmi menjadi semakin mudah sekaligus sering terabaikan. Padahal Rasulullah SAW bersabda: 'Barangsiapa yang ingin dilapangkan rezekinya dan dipanjangkan umurnya, hendaklah ia menyambung tali silaturahmi.' Silaturahmi bukan sekadar berkunjung, namun juga memaafkan kerabat yang memutus hubungan.",
    "date": "2026-02-18"
  },
  {
    "id": "105",
    "title": "Hukum Membaca Al-Quran Melalui HP",
    "content": "Membaca Al-Quran melalui smartphone hukumnya mubah (boleh) dan mendapat pahala yang sama dengan membaca mushaf cetak. Keunggulannya adalah mudah dibawa dan dibaca kapan saja. Namun, disarankan tetap menjaga adab seperti dalam keadaan suci, di tempat yang baik, dan tidak membawa HP yang sedang menampilkan ayat suci ke dalam kamar mandi.",
    "date": "2026-02-17"
  },
  {
    "id": "106",
    "title": "Pentingnya Menjaga Lisan di Media Sosial",
    "content": "Sosial media merupakan pisau bermata dua. Hati-hati dengan jempol kita, karena tulisan di media sosial sama dengan ucapan. 'Barangsiapa beriman kepada Allah dan hari akhir, hendaklah ia berkata baik atau diam.' (HR Bukhari & Muslim). Hindari menyebar hoaks, ghibah online, maupun komentar provokatif.",
    "date": "2026-02-16"
  },
  {
    "id": "107",
    "title": "Sholat Dhuha: Sedekah Bagi Seluruh Persendian",
    "content": "Setiap pagi, manusia berutang sedekah atas setiap persendian tubuhnya yang berjumlah 360. Semua hutang sedekah itu dapat dilunasi dengan dua rakaat sholat Dhuha. Waktu Dhuha dimulai sejak matahari naik setinggi tombak hingga menjelang waktu Dzuhur. Rakaat optimalnya adalah dua, empat, atau delapan rakaat.",
    "date": "2026-02-15"
  },
  {
    "id": "108",
    "title": "Batas Waktu Mengqadha Puasa Ramadhan",
    "content": "Batas waktu untuk melunasi utang (qadha) puasa Ramadhan tahun lalu adalah hingga tibanya bulan Syakban (sebelum masuk Ramadhan berikutnya). Sayyidah Aisyah ra menceritakan bahwa beliau pernah tidak bisa mengqadha puasa kecuali di bulan Syakban karena kesibukan melayani Rasulullah SAW.",
    "date": "2026-02-14"
  },
  {
    "id": "109",
    "title": "Mengenal Perbedaan Ikhlas dan Riya",
    "content": "Ikhlas adalah beramal murni karena Allah SWT, tanpa mengharap pujian manusia. Riya (syirik kecil) adalah melakukan ibadah agar dilihat/dipuji orang lain. Untuk menguji keikhlasan: apakah amal kita sama kualitasnya saat sendirian versus saat dilihat orang banyak? Jika berbeda, segera perbarui niat kita.",
    "date": "2026-02-13"
  },
  {
    "id": "110",
    "title": "Rukun dan Syarat Mandi Wajib",
    "content": "Mandi wajib (Junub) memiliki dua rukun utama: 1. Niat dalam hati ('Nawaitul ghusla li raf'il hadatsil akbari fardhan lillaahi ta'aalaa'), 2. Meratakan air ke seluruh bagian luar anggota tubuh, termasuk kulit di bawah rambut/bulu. Disunnahkan membasuh tangan, kemaluan, dan berwudhu terlebih dahulu sebelum mengguyur air ke kepala.",
    "date": "2026-02-12"
  },
  {
    "id": "1771767962979",
    "title": "Kebaikan Berbagi di Bulan Ramadhan",
    "content": "Berbagi di bulan Ramadhan memiliki pahala yang berlipat ganda. Mari kita tingkatkan kepedulian sesama di bulan suci ini agar mendapatkan ridho Allah SWT.",
    "date": "2026-02-22"
  }
]